{
  "backend/main.mo": "Motoko actor defining data types (Entrepreneur, SuccessStory, TrainingResource, CommunityPost) and CRUD operations for a Youth Entrepreneur Empowerment platform, storing records in in-memory Maps with auto-incrementing IDs.",
  "feature_evidence.json": "JSON report mapping each platform feature (landing page, registration, directory, dashboard, etc.) to the frontend files that implement them, along with component dependencies and test IDs.",
  "frontend-file-summaries.txt": "Short JSON descriptions of three frontend pages: CommunityPage, DirectoryPage, and StoriesPage, noting key UI behaviors and a TanStack Router Link fix.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'Youth Entrepreneur Empowerment Program' and mounting the app via /src/main.tsx.",
  "frontend/src/App.tsx": "Defines the TanStack Router route tree with all application routes (home, register, directory, entrepreneur profile, dashboard, resources, stories, story detail, community) wrapped in a shared Layout.",
  "frontend/src/components/Layout.tsx": "Shared page shell with a sticky header containing the YEEP logo, desktop and mobile navigation links, and a 'Join Now' CTA button linking to the registration page.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor (anonymous or authenticated) using TanStack Query, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, exposing login/clear functions and login status to the component tree.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on entrepreneurs, success stories, training resources, and community posts, each using the ICP actor from useActor.",
  "frontend/src/index.css": "Global stylesheet that imports Poppins/Noto Serif fonts, sets up Tailwind base/components/utilities, and defines a saffron-green-offwhite CSS custom property palette with light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CommunityPage.tsx": "Community forum page that displays filterable community posts and provides a form to submit new posts with author, location, category, and message fields.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page that aggregates entrepreneur data by panchayat, showing summary stats and per-panchayat progress toward a 1000-entrepreneur target with category breakdowns.",
  "frontend/src/pages/DirectoryPage.tsx": "Entrepreneur directory page with search and multi-filter (state, district, category) controls that renders a filterable list of registered village entrepreneurs.",
  "frontend/src/pages/EntrepreneurProfilePage.tsx": "Displays a detailed profile page for a single entrepreneur fetched by ID, showing their name, location, business category, bio, contact info, skills, and age/gender details with loading and error states.",
  "frontend/src/pages/HomePage.tsx": "Renders the landing page with a hero banner, live entrepreneur count stat, four program pillars (Find, Equip, Motivate, Connect), and call-to-action buttons linking to registration and the directory.",
  "frontend/src/pages/RegisterPage.tsx": "Provides a multi-field registration form for new entrepreneurs, including validation, dynamic skill tag input, and submission via the useRegisterEntrepreneur mutation with a success confirmation state.",
  "frontend/src/pages/ResourcesPage.tsx": "Lists training resources (courses, guides, tools, videos) fetched from the backend, with filterable tabs by category and type, displaying each resource as a card with an external link.",
  "frontend/src/pages/StoriesPage.tsx": "Shows a filterable grid of entrepreneur success stories fetched from the backend, allowing filtering by business category and village, with a styled hero header and loading skeletons.",
  "frontend/src/pages/StoryDetailPage.tsx": "Displays a detailed view of a single success story fetched by ID from the URL params, showing title, author, location, date, category badge, and full content. Includes loading skeleton and not-found states with navigation back to the stories list.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palettes (saffron, forest, cream), typography/container-query/animate plugins, custom fonts (Poppins, Noto Serif), border radii, and box shadows for the frontend design system.",
  "project_state.json": "Tracks the overall project state for the Youth Entrepreneur Empowerment Program, including version, architectural notes, existing features, known issues, and image requirements for the platform targeting rural Indian entrepreneurs."
}